Repository: 84000/data-translation-memory
Catalog: toh156-v3.tmx
Source language: bo
Languages: en

source: བཞིན་བཟངས་དག་ཆོས་ཀྱི་འཁོར་ལོ་ཞེས་བྱ་བ་ནི་དོན་དམ་པའི་འཁོར་ལོ་སྟེ། བདེན་པ་མི་ཕྱེད་པའི་རྣམ་པས་བསྐོར་བའོ། །
en: “Friends, that which is known as the wheel of Dharma is the wheel of ultimate truth, turned by the undivided truth.

source: དུས་གསུམ་མཉམ་པས་ཇི་ལྟ་བ་བཞིན་གྱི་འཁོར་ལོའོ། །
en: Because of the equality of the three times, it is the wheel of things just as they are.

source: དངོས་པོར་ལྟ་བ་ལས་རབ་ཏུ་འདས་པའི་ཕྱིར་དངོས་པོ་མེད་པའི་འཁོར་ལོའོ། །
en: Since it transcends the view of entities, it is the wheel of entitylessness.

source: ལུས་དང་སེམས་མ་འདྲེས་ཤིང་ཡིད་དང་རྣམ་པར་ཤེས་པ་དང་བྲལ་བས་དབེན་པའི་འཁོར་ལོའོ། །
en: Since it is mixed with neither the body nor the mind and is free of mental faculty and consciousness, it is the wheel of disengagement.

source: འགྲོ་བ་ལྔ་དང་ཕྲད་པ་མ་ཡིན་པས་ཀུན་གཞི་མེད་པའི་འཁོར་ལོའོ། །
en: Since it is separate from the five forms of life, it is the wheel of the absence of foundation.

source: འབྱུང་བ་ཆེན་པོ་ངོ་བོ་ཉིད་ཀྱིས་དངོས་པོ་མེད་པས་ཡང་དག་པའི་འཁོར་ལོའོ། །
en: Since the great elements are essentially insubstantial, it is the wheel of reality.

source: ཡང་དག་པར་སྦྱོར་ཞིང་སླུ་བ་མ་ཡིན་པས་མཉམ་པའི་འཁོར་ལོའོ། །
en: Since it connects with reality and not with deception, it is the wheel of sameness.

source: ཡི་གེ་མི་ཟད་པས་མི་ཟད་པའི་འཁོར་ལོའོ། །
en: Since its words are inexhaustible, it is the wheel of inexhaustibility.

source: ཆོས་ཐམས་ཅད་ཆོས་ཀྱི་དབྱིངས་སུ་ཡང་དག་པར་འདུ་བས། ཆོས་ཀྱི་དབྱིངས་ཀྱི་འཁོར་ལོའོ། །
en: Since the realm of phenomena encompasses all phenomena, it is the wheel of the realm of phenomena.

source: སྔོན་གྱི་མཐའ་མ་ཡིན་པར་སྐོར་བས་ཡང་དག་པའི་མཐའི་འཁོར་ལོའོ། །
en: Since it has been turning since beginningless time, it is the wheel of the limit of reality.

source: ངོ་བོ་ཉིད་ཀྱིས་ངོ་བོ་ཉིད་མེད་པས་དེ་བཞིན་ཉིད་ཀྱི་འཁོར་ལོའོ། །
en: Since it is naturally devoid of essence, it is the wheel of thusness.

source: རང་གི་ཡིད་ལ་བྱེད་པ་རྒྱུན་བཅད་པས་མངོན་པར་འདུ་མི་བྱེད་པའི་འཁོར་ལོའོ། །
en: Since it severs the flow of mental activity, it is the wheel of the absence of formation.

source: འཕགས་པའི་སྤྱོད་ཡུལ་ཐོབ་པར་བྱེད་པའི་ཕྱིར་འདུས་མ་བྱས་པའི་འཁོར་ལོའོ། །
en: Since it leads to the attainment of the noble realm, it is the wheel of the unconditioned.

source: ནང་ཀུན་ཏུ་སྟོན་པས་སྟོང་པ་ཉིད་ཀྱི་འཁོར་ལོའོ། །
en: Since it reveals everything inside, it is the wheel of emptiness.

source: ཕྱི་རོལ་ལ་མི་འཇུག་པས་མཚན་མ་མེད་པའི་འཁོར་ལོའོ། །
en: Since it does not engage with anything outside, it is the wheel of signlessness.

source: ཕྱི་ནང་གི་དང་མ་འདྲེས་པས་སྨོན་པ་མེད་པའི་འཁོར་ལོའོ། །
en: Since it is untainted by both the external and the internal, it is the wheel of wishlessness.

source: བརྗོད་པ་མེད་པའི་ཚུལ་གྱིས་བརྗོད་དུ་མེད་པའི་འཁོར་ལོའོ། །
en: Since it is beyond expression, it is the wheel of the ineffable.

source: བཞིན་བཟངས་དག་ཆོས་ཀྱི་འཁོར་ལོ་དེ་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་གྱི་དབང་པོ་ལ་བསྐོར་ཀྱང་རུང་། མ་བསྐོར་ཀྱང་རུང་བརྗོད་དུ་མེད་པའི་ཆོས་ཉིད་འདི་མི་འདོར་ཏེ།
en: “Friends, whether or not a thus-gone one turns the wheel of Dharma based on the capacities of beings, this ineffable true nature is not lost.

source: བཞིན་བཟངས་དག་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ཞེས་བྱའོ། །
en: Friends, this is known as a bodhisattva’s turning of the wheel of Dharma.”

source: ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་འདི་བསྟན་པའི་ཚེ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་།
en: When the Blessed One gave this teaching on turning the wheel of Dharma, gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas let out cries of surprise and joy, exclaiming, “This wheel of Dharma turned by the Thus-Gone One is an act of perfect insight, a task difficult to perform.

source: ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དེ་དག་གིས་ཅ་ཅོ་དང་ག་ཞའི་སྒྲ་ཕྱུང་སྟེ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །དེ་བཞིན་གཤེགས་པས་འདི་འདྲ་བའི་ཆོས་ཀྱི་འཁོར་ལོ་འདི་བསྐོར་ཅིང་ཕ་རོལ་ཤེས་པར་མཛད་པ་ནི་མཛད་དཀའ་བ་མཛད་པའོ། །བཅོམ་ལྡན་འདས་ནམ་མཁའི་འཁོར་ལོ་བསྐོར་བ་དེ་ནི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའོ། །
en: Blessed One, by turning this wheel of space, the wheel of Dharma has been turned.

source: གང་དག་གིས་འཚལ་བ་དེ་དག་གིས་ཀྱང་དེ་དང་མཉམ་པ་ཉིད་དུ་འཚལ་བ་དང་།
en: Those who seek it seek sameness, and their generation of the mind of awakening, Blessed One, is to be celebrated.

source: བཅོམ་ལྡན་འདས་སེམས་བསྐྱེད་པ་དེ་དག་ལ་རྗེས་སུ་ཡི་རང་ངོ་། །གང་དག་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་འདི་ཐོས་ནས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་འགྱུར་བ་དེ་དག་ཀྱང་ཆོས་ཀྱི་འཁོར་ལོ་འདི་ལྟ་བུ་བསྐོར་བར་འགྱུར་རོ། །
en: Those who generate the mind of awakening upon hearing this turning of the wheel of Dharma will themselves turn this wheel of Dharma in the same way.”

source: དེ་ལྟར་བསྟན་པ་འདི་ཐོས་ནས་འཁོར་དེ་ལས་སྲོག་ཆགས་ཁྲིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: And so, upon hearing this teaching, ten thousand beings from among the assembly developed the intention to reach unsurpassed and perfect awakening.

source: བཞིན་བཟངས་དག་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་གང་ཞེ་ན།
en: “Friends, how does a bodhisattva maintain the sacred Dharma?

source: བཞིན་བཟངས་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་སྡུད་པ་སྟེ།
en: Friends, maintaining the sacred Dharma encompasses all phenomena.

source: ཆོས་ཐམས་ཅད་ཡང་དག་པར་སྡུད་པ་འདི་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ཞེས་བྱའོ། །
en: This encompassing of all phenomena is what is referred to as maintaining the sacred Dharma.

source: བཞིན་བཟངས་དག་གཞན་ཡང་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ནི་གང་དེ་བཞིན་གཤེགས་པས་སྤྱོད་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་།
en: “Furthermore, friends, to maintain the sacred Dharma encompasses the eighty-four thousand activities of a thus-gone one and the eighty-four thousand collections of Dharma teachings that explain the eighty-four thousand aspects of the Dharma.

source: ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་བསྟན་པའི་ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དེ་དག་སྡུད་པ་དེ་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ཞེས་བྱའོ། །
en: This is known as maintaining the sacred Dharma.

source: བཞིན་བཟངས་དག་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་བཞིན་དུ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཏོ། །དེ་བཞིན་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །
en: “Friends, just as a thus-gone one awakens to perfect buddhahood, so do they turn the wheel of Dharma, and so do they pass into parinirvāṇa.

source: དེ་བཞིན་ཉིད་ཇི་ལྟ་བ་དང་།
en: Thusness is like that.

source: དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ལ་ཆོས་ཐམས་ཅད་ཀྱི་སྐྱེ་བ་མེད། འགག་པ་མེད་དོ། །
en: In thusness all phenomena are without birth and without cessation.

source: གང་མི་སྐྱེ་མི་འགག་པ་དེ་ལ་འཛིན་པ་མེད། འཐབ་པ་མེད། རྩོད་པ་མེད། བསྟན་པ་མེད། ཤིན་ཏུ་བརྗོད་པ་མེད་དོ། །
en: Regarding that which does not arise and does not cease, there is no clinging, no conflict, no dispute, and no teaching, nor even any expression.

source: གང་བརྗོད་དུ་མེད་པ་དེ་ལ་དམ་པའི་ཆོས་བསྡུ་བ་གང་ཡང་མེད་དོ། །
en: Regarding the inexpressible there is nothing at all, including the sacred Dharma.

source: དེའི་ཕྱིར་བསྡུ་བ་མེད།
en: Therefore, it is beyond inclusion.

source: ཡོངས་སུ་འཛིན་པ་མེད་པ་ནི་དམ་པའི་ཆོས་ཞེས་བྱའོ། །
en: The absence of maintaining is known as the sacred Dharma.”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པའི་བུ་མྱ་ངན་མེད་པ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལ་སྤོབས་སོ། །
en: Then Aśoka, a son of the nāga king Anavatapta, said to the Blessed One, “Blessed One, I am inspired to speak about maintaining the sacred Dharma.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མྱ་ངན་མེད་པ་ཁྱོད་སྤོབས་པར་གྱིས་ཤིག །
en: “Go ahead, Aśoka, Speak,” replied the Blessed One.

source: གསོལ་པ། བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོ་ན་རིན་པོ་ཆེ་བདག་གི་མ་མཆིས་པ། ཡོངས་སུ་འཛིན་པ་མ་མཆིས་པ། ཡོངས་སུ་གཟུང་བ་མ་མཆིས་པ་གང་དག་མཆིས་པ་དེ་དག་བསྲུང་བར་བགྱི་བ་མ་ལགས་མོད་ཀྱི།
en: “Blessed One, it is like the analogy of precious jewels in the vast ocean—they are not owned, held, or possessed, nor are they guarded by anyone.

source: འོན་ཀྱང་བཅོམ་ལྡན་འདས་དེད་དཔོན་དང་། དེད་དཔོན་ཆེན་པོ་གང་དག་ལུས་དང་སྲོག་ལ་མི་ལྟ་བར་རིན་པོ་ཆེ་ཆེན་པོ་དེ་དག་འཚལ་བའི་སླད་དུ་རྒྱ་མཚོ་ཆེན་པོར་ཞུགས་པ་དེ་དག་འཛམ་བུའི་གླིང་དུ་མ་ཕྱིན་པར་བར་མ་དོར་རྒྱ་མཚོའི་ནང་དུ་འཁྱམས་པར་མི་འགྱུར་བར་ཤིན་ཏུ་བསྲུང་བ་བགྱིས་ཏེ།
en: Yet, Blessed One, merchants and traders ply the vast ocean in search of those precious jewels without regard for life or limb, and until they return to Jambudvīpa, they guard them closely, not losing their way as they traverse the ocean.

source: དེ་དག་རྒྱ་མཚོར་ཞུགས་ཤིང་འོང་བ་དང་འགྲོ་བའི་ཚེ་བསྲུང་བ་ཆེན་པོ་བགྱིས་ནས། དེ་ལྟར་རིན་པོ་ཆེ་དེ་དག་འཛམ་བུའི་གླིང་དུ་ཕྱིན་པ་དང་། སྐྱེ་བོ་མང་པོ་འཚོ་བར་འགྱུར་རོ། །
en: They guard them carefully when coming and going across the ocean, and as a result those precious jewels eventually reach Jambudvīpa and provide a livelihood for many beings.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ཆོས་གང་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ཤིན་ཏུ་མངོན་པར་གྲུབ་པ་མ་མཆིས་ཏེ། དེ་ནི་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གང་གིས་ཀྱང་ཡོངས་སུ་གཟུང་བར་མི་ནུས་མོད་ཀྱི།
en: “Blessed One, the Dharma of the Thus-Gone One, who has awakened to perfect buddhahood, is likewise beyond attainment; it is impossible for anyone in the whole world with its gods to hold it.

source: འོན་ཀྱང་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་འདི་འདྲ་བའི་ཆོས་དཀོན་མཆོག་དེ་བཞིན་ཉིད་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་བགྱི་བའི་སླད་དུ་གོ་ཆ་འཚལ་བ་དེ་དག་ཤིན་ཏུ་ཡོངས་སུ་བསྲུང་བར་བགྱིས་ཏེ།
en: Yet, Blessed One, bodhisattva great beings who don the armor in order to awaken to perfect buddhahood—thusness—closely guard the jewel of Dharma.

source: སྐྱེས་བུ་དམ་པ་དེ་དག་ཤིན་ཏུ་ཡོངས་སུ་བཟུང་ན་ཐེག་པ་ཆེན་པོ་འདིར་ངེས་པར་འབྱུང་བར་འགྱུར་རོ། །
en: If those holy beings truly possess it, they will reach emancipation within this Great Vehicle.

source: དེ་དག་བྱུང་བར་གྱུར་ན་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བར་འགྱུར་ཏེ། དམ་པའི་ཆོས་ཡོངས་སུ་འབར་བར་འགྱུར་རོ། །
en: And if they reach emancipation, they will turn the wheel of Dharma, and the sacred Dharma will flourish.

source: བཅོམ་ལྡན་འདས་དེ་ལྟ་བས་ན་གང་འདི་ཆོས་སྨྲ་བ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་ཡོངས་སུ་འཛིན་པ་དང་། སྲུང་བ་དང་། སྐྱོབ་པ་དང་། སྦེད་པ་དང་། རིམ་གྲོ་བགྱིད་པ་དང་། བླ་མའི་ཡོངས་སུ་སྤྱད་པ་བགྱིད་པ་དེ་ནི་དམ་པའི་ཆོས་ཡང་དག་ཕུལ་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Therefore, Blessed One, those Dharma preachers who have genuinely entered the Great Vehicle and really maintain it, guard it, protect it, keep it secret, worship it, and adopt the conduct of the masters are those who genuinely make offerings and maintain the sacred Dharma.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པའི་བུ་མྱ་ངན་མེད་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གནང་སྟེ། མྱ་ངན་མེད་པ་ལེགས་སོ་ལེགས་སོ། །
en: The Blessed One gave his approval to Aśoka, the son of the nāga king Anavatapta, saying, “Excellent, Aśoka, excellent!

source: གང་འདི་ཆོས་སྨྲ་བ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་ཡོངས་སུ་འཛིན་པ་དང་། ཀུན་ཏུ་སྲུང་བ་འདི་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ཡིན་ནོ། །
en: Those Dharma preachers who have genuinely entered the Great Vehicle and really maintain it and guard it are indeed those who maintain the sacred Dharma.

source: ཆོས་སྨྲ་བ་ཡོངས་སུ་བཟུང་བས་དམ་པའི་ཆོས་ཡོངས་སུ་བཟུང་བ་ཡིན་ཀྱི།
en: By maintaining their Dharma preaching, they maintain the sacred Dharma.

source: འོན་ཀྱང་མྱ་ངན་མེད་པ་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་བཅུ་སྟེ།
en: “Moreover, Aśoka, there are ten ways of maintaining the sacred Dharma.

source: བཅུ་གང་ཞེ་ན། ཁེངས་པ་མེད་པ་དང་།
en: What are the ten?

source: ལྷག་པའི་ང་རྒྱལ་མེད་པ་དང་། གཡོ་བ་མེད་པ་དང་། ཆོས་དོན་དུ་གཉེར་བ་དང་། ཆོས་འདོད་པ་དང་། ཆོས་ཡོངས་སུ་ཚོལ་བ་དང་།
en: They are being without arrogance, being without excessive pride, being straightforward, striving for the Dharma, aspiring to the Dharma, seeking the Dharma, understanding phenomena in detail, teaching the Dharma, persevering in the Dharma, and being liberated by observing one’s Dharma practice and being devoted to it.

source: ཆོས་ལ་སོ་སོར་རྟོག་པ་དང་།
en: Those are ten ways of maintaining the Dharma.

source: ཆོས་སྟོན་པ་དང་། ཆོས་ལ་ནན་ཏན་བྱེད་པ་དང་། ཆོས་སྒྲུབ་པར་གནས་ཤིང་མོས་ལ་རྣམ་པར་གྲོལ་བ་སྟེ། བཅུ་པོ་དེ་དག་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའོ། །གཞན་ཡང་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་བཅུ་སྟེ།
en: “There are ten further ways of maintaining the Dharma.

source: བཅུ་གང་ཞེ་ན།
en: What are the ten?

source: མྱ་ངན་མེད་པ་འདི་ལ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོས་ཆོས་སྨྲ་བ་ཞིག་ཡོད་པར་ཐོས་ན་ཕྱོགས་དེར་ཕྱག་འཚལ་བ་དང་། མཐོང་བར་དགའ་བ་དང་། འོངས་ནས་མགུ་བར་བྱེད་པ་དང་། སྟན་འདིང་ཞིང་གོས་དང་ཟས་སྦྱོར་བ་དང་། ཀུན་ཏུ་སྲུང་བར་བྱེད་པ་དང་། བསྟི་སྟང་བྱས་ཏེ་བསྙེན་བཀུར་བྱེད་པ་དང་། དེས་བཤད་པ་ཉན་པ་དང་། ཇི་ལྟར་ཐོས་པ་ལྟར་གཞན་དག་ལ་ཡང་སྟོན་པ་དང་།
en: Aśoka, when noble sons and noble daughters listen with devotion to Dharma preachers, they bow in their direction; they are delighted to see them; they are pleased when they arrive; they prepare cushions, food, and clothing for them; they protect them; they serve them with respect; they listen to their explanations; they teach what they hear from them to others; they refute the criticisms directed at them; and they praise them.

source: དེའི་མི་སྙན་པ་འགོག་པ་དང་། དེའི་བསྔགས་པ་བརྗོད་པ་སྟེ། མྱ་ངན་མེད་པ་བཅུ་པོ་དེ་དག་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའོ། །
en: Aśoka, those are ten ways of maintaining the Dharma.

source: མྱ་ངན་མེད་པ་གཞན་ཡང་སྦྱིན་པ་བཞི་པོ་འདི་དག་ནི། དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པར་འགྱུར་བ་སྟེ།
en: “Furthermore Aśoka, there are four types of generosity through which the sacred Dharma will be maintained.

source: བཞི་གང་ཞེ་ན། གྲོ་ག་དང་། སྣག་ཚ་དང་། སྨྱུག་གུ་དང་།
en: What are the four?

source: གླེགས་བམ་སྦྱིན་པ་དང་། ཆོས་སྨྲ་བ་རྣམས་ལ་གོས་དང་། ཟས་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་།
en: They are giving birch bark, ink, bamboo, and volumes of scriptures; giving clothing, food, bedding, medicine, and tools to those who preach the Dharma; giving straightforward praise to those who teach the Dharma when one hears their teachings; and giving the gift of the Dharma.

source: ཡོ་བྱད་སྦྱིན་པ་དང་། ཆོས་ཐོས་ནས་ཆོས་སྨྲ་བ་རྣམས་ལ་གཡོ་མེད་པར་ལེགས་སོ་ཞེས་བྱ་བ་སྦྱིན་པ་དང་། ཆོས་སྦྱིན་པ་ནི་བཞི་པ་སྟེ། སྦྱིན་པ་བཞི་པོ་དེ་དག་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པར་འགྱུར་བའོ། །
en: These are the four Dharma gifts by which the sacred Dharma will be maintained.

source: མྱ་ངན་མེད་པ་བརྩོན་འགྲུས་བཞི་པོ་འདི་དག་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པར་འགྱུར་བ་སྟེ།
en: “Aśoka, there are four types of diligence through which the sacred Dharma will be maintained.

source: ཆོས་སྟོན་པའི་བརྩོན་འགྲུས་དང་། ཆོས་ཀུན་ཏུ་ཚོལ་བའི་བརྩོན་འགྲུས་དང་། ཆོས་སྨྲ་བ་ལ་བསྙེན་བཀུར་བྱ་བའི་བརྩོན་འགྲུས་དང་། དམ་པའི་ཆོས་སྤོང་བའི་སེམས་ཅན་རྣམས་ཆོས་དང་འཐུན་པས་ཚར་གཅད་པའི་བརྩོན་འགྲུས་ཏེ།
en: They are diligence in teaching the Dharma; diligence in pursuing the Dharma at all times; diligence in serving Dharma preachers; and diligence in defeating, in accordance with the teachings, those who have rejected the sacred Dharma.

source: མྱ་ངན་མེད་པ་བརྩོན་འགྲུས་བཞི་པོ་དེ་དག་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པར་འགྱུར་བའོ། །
en: With these four types of diligence, Aśoka, the sacred Dharma will be maintained.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཞུས་པ་ལུང་བསྟན་པས་ཀླུ་གཞོན་ནུ་ལྔ་བརྒྱ་པོ་དེ་དག་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ལ་བསྙེན་བཀུར་བྱ་བ་དང་།
en: Satisfied by the Blessed One’s answers to their questions, the five hundred young nāgas were pleased and rejoiced, and they worshiped the Blessed One.

source: ཀུན་ཏུ་སྤྱད་པའི་ཕྱིར་གཉེན་དང་འཁོར་དུ་བཅས་པ་དང་། རང་རང་གི་ལུས་ཕུལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །དེང་སླན་ཆད་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱི་བར་དུ་བདག་ཅག་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་འབྲིང་ན་རྟག་པར་རྒྱུན་དུ་མཆིས་ལ་འདི་ལྟ་བུའི་དམ་པའི་ཆོས་ཀུན་ཏུ་བསྲུང་ཞིང་སྦ་བའི་སླད་དུ་སྤྲོ་བར་བགྱིའོ། །
en: For the sake of all the activities, each of them, along with their relatives and retinues, offered him their own bodies and said, “From today until your parinirvāṇa, Blessed One, we will always serve you, and we will be delighted to guard and conceal this holy Dharma in its entirety.

source: བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་སྐུ་མ་གྱེས་ཤིང་གཅིག་ཏུ་མཁྲེགས་པ་ལ་མཆོད་པ་བགྱིད་པ་དང་། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་མཆོད་རྟེན་བགྱི་བར་འཚལ་ལོ། །
en: And, Blessed One, after the Thus-Gone One has passed into parinirvāṇa, we will continue to worship your exalted body, undivided and whole, and will seek the seven precious materials so as to make a shrine for it.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོས་ཀླུ་གཞོན་ནུ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་ཆེར་ཐུགས་རྗེ་ཆེ་བས་རིང་བསྲེལ་ཡུངས་འབྲུ་ཙམ་བྱིན་གྱིས་བརླབ་པ་མཛད་ན། རིགས་ཀྱི་བུ་དག་ཁྱེད་དེ་བཞིན་གཤེགས་པའི་སྐུ་མ་གྱེས་ཤིང་གཅིག་ཏུ་མཁྲེགས་པ་ལ་མཆོད་པ་བྱའོ། །ཞེས་དེ་སྐད་ཅེས་ཟེར་བ་ནི་སྐྱེ་བོ་ཕལ་པོ་ཆེའི་དགེ་བའི་ཆོས་ཀྱི་བར་ཆད་བྱེད་པར་འདོད་པ་ཡིན་ནོ། །
en: Then Venerable Mahākāśyapa said to the young nāgas, “If out of great compassion for all beings the Thus-Gone One manifests relics the size of mustard seeds, then you noble sons saying, ‘We will worship the Thus-Gone One’s exalted body, undivided and whole,’ amounts to wanting to obstruct virtuous qualities for most beings.”

source: དེ་ནས་ཀླུ་གཞོན་ནུ་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་འོད་སྲུང་ཁྱོད་དེ་སྐད་མ་གསུང་ཤིག །རང་གི་ཤེས་རབ་དང་།
en: The five hundred young nāgas replied to Venerable Mahākāśyapa, “Revered Kāśyapa, do not say such things!

source: དེ་བཞིན་གཤེགས་པའི་ཤེས་རབ་དང་། ཡེ་ཤེས་མཚུངས་པ་མཉམ་དུ་མ་བསྒྲུན་ཅིག །
en: Your insight does not compare to the insight and wisdom of the Thus-Gone One!

source: དེ་བཞིན་གཤེགས་པ་ནི་ཐམས་ཅད་མཁྱེན་པ། ཐམས་ཅད་གཟིགས་པ་སྟེ།
en: The Thus-Gone One is omniscient and all seeing.

source: བྱིན་གྱི་རླབས་དང་རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་ཅན་ཏེ།
en: He is endowed with the power of wisdom that manifests blessings and miraculous power.

source: དེ་བཞེད་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་གྱི་གནས་ཐམས་ཅད་དུ་མ་གྱེས་ཤིང་གཅིག་ཏུ་མཁྲེགས་པའི་སྐུ་བྱིན་གྱིས་རློབ་སྟེ། དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་གཞན་ནི་མ་ཡིན་གྱི། དེ་བཞིན་གཤེགས་པ་ལ་བདག་ཅག་མཆོད་པ་བྱེད་པར་ཤེས་སོ། །
en: If he so wishes, he could project his body, undivided and whole, into each of the many realms of gods, nāgas, and yakṣas in this great trichiliocosm, and all those beings would know that they were worshiping the Thus-Gone One and no one else.

source: བཙུན་པ་འོད་སྲུང་ཆེན་པོ་ཡང་གང་གི་ཚེ་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དེའི་ཚེ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་མོས་པས་སྐུ་གདུང་བྱིན་གྱིས་རླབ་བོ། །
en: Revered Mahākāśyapa, when the Thus-Gone One passes into parinirvāṇa, the minds of all those beings, through their devotion, will be blessed with bodily relics.

source: བཙུན་པ་འོད་སྲུང་ཆེན་པོ་གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་འོག་མིན་གྱི་གནས་སུ་ཡུངས་འབྲུ་ཙམ་གྱི་སྐུ་གདུང་གཅིག་བྱིན་གྱིས་བརླབས་ནས།
en: Revered Mahākāśyapa, just one such bodily relic the size of a mere mustard seed in the Highest Heaven could illuminate the whole of Jambudvīpa.

source: དེས་འཛམ་བུའི་གླིང་ཐམས་ཅད་དུ་ཁྱབ་པར་སྣང་བ་དེ་ཡང་སངས་རྒྱས་ཀྱི་རྣམ་པར་སྤྲུལ་བའོ། །
en: Such is the miraculous power of the Buddha.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་ཀླུའི་རྒྱལ་པོའི་བུ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་འམ། སྨྲས་པ།
en: Venerable Subhūti then said to those sons of the nāga king, “Noble sons, do thus-gone ones pass into parinirvāṇa?”

source: བཙུན་པ་རབ་འབྱོར་གང་དག་སྐྱེས་པ་དེ་དག་ཡོངས་སུ་མྱ་ངན་ལས་འདའོ། །
en: “Revered Subhūti, all who are born will pass into parinirvāṇa.”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་དག་ཁྱོད་དེ་བཞིན་གཤེགས་པ་སྐྱེས་སོ་སྙམའམ།
en: “Noble sons, do you consider the Thus-Gone One as having been born?”

source: སྨྲས་པ། དེ་བཞིན་ཉིད་ཇི་ལྟར་བྱུང་བ་དེ་ལྟར་སྐྱེས་སོ། །
en: “He was born in the way that thusness arises.”

source: སྨྲས་པ། གལ་ཏེ་དེ་བཞིན་ཉིད་ཇི་ལྟར་སྐྱེ་བ་དེ་ལྟར་སྐྱེས་ན་དེ་ལ་ནི་ཆོས་གང་གི་སྐྱེ་བ་ཡང་མེད་དོ། །
en: “If he was born in the way that thusness arises, then there is also no arising of any phenomenon.”

source: སྨྲས་པ། བཙུན་པ་རབ་འབྱོར་གང་དེ་བཞིན་ཉིད་སྐྱེ་བ་དེ་སངས་རྒྱས་སྐྱེ་བའོ། །
en: “Revered Subhūti, the arising of thusness is the arising of buddhahood.”

source: སྨྲས་པ། གང་སངས་རྒྱས་སྐྱེ་བ་འདི་འདྲ་ན་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ཅི་འདྲ།
en: “If the arising of buddhahood is like this, what is parinirvāṇa like?”

source: སྨྲས་པ། བཙུན་པ་རབ་འབྱོར་ཇི་ལྟར་སྐྱེ་བ་མེད་པ་དེ་ལྟར་འགག་པ་མེད་དོ། །
en: “Revered Subhūti, just as there is no birth, there is no cessation.

source: དེ་ལྟར་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་རོ། །
en: This is how the wheel of Dharma is turned.

source: དེ་ལྟར་ཡོངས་སུ་མྱ་ངན་ལས་འདའོ། །
en: This is what parinirvāṇa is like.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་གཏམ་འདི་བཀའ་སྩལ་ཅིང་བཤད་པའི་ཚེ་མཚོ་ཆེན་པོ་མ་དྲོས་པ་རིན་པོ་ཆེའི་པད་མ་ཚད་ཤིང་རྟའི་འཁོར་ལོ་ཙམ་དྲི་རབ་ཏུ་ཞིམ་པ་འདབ་མ་བརྒྱ་སྟོང་དུ་མ་དང་ལྡན་པ་རིན་པོ་ཆེའི་དྲ་བས་གཡོགས་པས་གང་བར་གྱུར་ཏོ། །
en: At this point in the discussion, the Blessed One spread a jeweled net over all the precious and fragrant lotus flowers of Lake Anavatapta, each the size of a cart wheel and with a hundred thousand petals.

source: དེ་དག་གི་ནང་ནས་རིན་པོ་ཆེའི་པད་མ་གཅིག་ཤིན་ཏུ་མཛེས་ཤིང་བལྟ་ན་རབ་ཏུ་སྡུག་ལ་མཆོག་ཏུ་འབར་བར་གྱུར་ཏོ། །
en: At their center, a single exquisite and magnificent precious lotus burst forth.

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་པད་མ་བཀོད་པ་དེ་དག་མཐོང་ངོ་། །མཐོང་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་སུའི་ལྟས་སྔོན་དུ་བྱུང་བ་ལགས།
en: When he saw this array of lotuses, Venerable Ānanda asked, “Blessed One, whose arrival is augured by these signs?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One responded, “Ānanda, wait a moment and you will see.”

source: ཀུན་དགའ་བོ་ཅུང་ཞིག་སྡོད་ཅིག་དང་མཐོང་བར་འགྱུར་རོ་ཞེས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་གསུངས་ནས་རིང་པོར་མ་ལོན་པར་འོག་གི་འཇིག་རྟེན་གྱི་ཁམས་བཅོམ་ལྡན་འདས་རིན་ཆེན་ཏོག་གི་སངས་རྒྱས་ཀྱི་ཞིང་རིན་པོ་ཆེ་བཀོད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ནས་བྱང་ཆུབ་སེམས་དཔའ་དྲུག་ཁྲི་བྱུང་སྟེ། དེ་དག་རིན་པོ་ཆེའི་པད་མ་དེ་དག་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་འཁོད་པར་ཀུན་དུ་སྣང་ངོ་། །
en: Soon after the Blessed One said these words, sixty thousand bodhisattvas appeared from below, arriving from the world system called Ratnavyūhā, the buddha field of the Blessed Ratnaketu, and sat cross-legged on the precious lotuses.

source: པད་མ་དེ་ལ་ཡང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འདུག་པར་ཀུན་དུ་སྣང་ངོ་། །
en: Mañjuśrīkumārabhūta, who also appeared, was seated on the central lotus.

source: དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ངོ་མཚར་དུ་གྱུར་ནས་ཐལ་མོ་སྦྱར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་ཕྱག་འཚལ་ནས།
en: All those assembled there joined their palms together in awe and prostrated to the bodhisattvas.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་བར་སྣང་ལ་འཕགས་པ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་ལ་སོགས་པ་ལྷ་རྣམས་དེའི་སྟེང་ན་རིན་པོ་ཆེའི་གདུགས་འཛིན་ཅིང་ཕྱག་འཚལ་ཏོ། །
en: Mañjuśrīkumārabhūta then rose up into the sky, and the gods Śakra and Brahmā and other gods greeted him from above by holding a jeweled parasol over him.

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་ལྷན་ཅིག་ལྷགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཀྱང་ཤིང་ཏ་ལ་བདུན་ཙམ་དུ་ནམ་མཁའ་ལ་འཕགས་ནས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་སྔོན་མ་མཐོང་མ་ཐོས་པའི་མེ་ཏོག་གི་ཆར་ནམ་མཁའི་ངོས་ལས་རབ་ཏུ་ཕབ་པོ། །
en: Joining Mañjuśrīkumārabhūta, the remaining bodhisattvas also rose into the sky, to a height of seven palm trees.

source: མེ་ཏོག་དེ་དག་ལས་འདི་ལྟ་བུའི་སྒྲ་བྱུང་སྟེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་ཏོག་བཅོམ་ལྡན་འདས་དེ་བཅོམ་ལྡན་འདས་ལ་གནོད་པ་ཆུང་ངམ།
en: As an offering to the Blessed One, they caused to rain down from the sky flowers such as had never been seen or heard of before, and from those flowers came a voice: “The blessed, thus-gone, worthy, perfect Buddha Ratnaketu inquires after the health of the Blessed One—‘Does the Blessed One have any small pains or discomforts?

source: ཉམ་ང་བ་ཉུང་ངམ། བསྐྱོད་པ་ཡང་ངམ། འཚོ་བ་དང་། སྟོབས་དང་། བདེ་བ་ལ་རེག་པར་གནས་སམ་ཞེས་སྙུན་གསོལ་ཏོ་ཞེས་དེ་སྐད་གསུང་ངོ་། །
en: Is he enjoying vitality, strength, and well-being?’

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འདི་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱད་ཁྲི་དང་ལྷན་ཅིག་ཏུ་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པའི་རྣམ་པར་དག་པའི་ལམ་གྱི་ཆོས་ཀྱི་སྒོའི་ལེའུ་ཉན་དུ་མཆིས་པ་སྟེ།
en: Mañjuśrīkumārabhūta has arrived with eighty thousand bodhisattvas to listen to the teaching on the Dharma gateway of the pure path of the nāga king Anavatapta.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་བཀའ་མཆིད་ཀྱིས་ཡང་དག་པར་དགའ་བར་མཛོད་ཅིག་ཅེས་སྒྲ་ཕྱུང་ངོ་། །
en: Rejoice in this Dharma discourse of the Blessed One!”
